{"backend": "tensorflow", "config": {"input_layers": [["input_features", 0, 0]], "name": "model", "output_layers": [["dense_5", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_features", "batch_input_shape": [null, 446]}, "name": "input_features"}, {"inbound_nodes": [[["input_features", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense", "units": 128}, "name": "dense"}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_1", "units": 128}, "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_2", "units": 128}, "name": "dense_2"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_3", "units": 128}, "name": "dense_3"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_4", "units": 2}, "name": "dense_4"}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_5", "units": 12}, "name": "dense_5"}]}, "class_name": "Model", "keras_version": "2.2.4-tf"}